{
  "backend/main.mo": "Defines types and a Motoko actor providing query endpoints for games, craftable items, categories, and update status using in‑memory Maps.",
  "feature_evidence.json": "Empty feature evidence report placeholder with no listed features.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend source files.",
  "frontend/docs/publish-to-production.md": "Documentation describing the promotion‑only process for publishing a draft build to production with pre‑publish checks.",
  "frontend/index.css": "Tailwind base layer defining CSS variables for themes and applying global background and text colors.",
  "frontend/index.html": "Main HTML entry for the SPA with deep‑link restoration logic using sessionStorage.",
  "frontend/public/404.html": "SPA fallback page that captures the original path and redirects to root to enable deep‑link handling.",
  "frontend/src/App.tsx": "Sets up the React router, query client, layout, routes, and deep‑link restoration for the SPA.",
  "frontend/src/components/EmptyState.tsx": "Reusable UI component showing a basic empty‑state message with optional icon, title, and description.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying copyright, caffeine.ai attribution, and a diagnostics link.",
  "frontend/src/components/layout/Header.tsx": "Sticky header with app logo, title, and a home button.",
  "frontend/src/hooks/useActor.ts": "React hook creating and managing a backend actor with identity‑aware initialization and query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useProductionPreflight.ts": "Runs one‑time backend connectivity checks on mount and records structured results in the preflight diagnostics store.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in React Query hooks for fetching games, catalog data, items, and update statuses with caching and error handling.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for a paper‑themed light and dark UI with subtle texture effects.",
  "frontend/src/lib/diagnostics/collectFrontendDiagnostics.ts": "Collects runtime, environment, build, and preflight diagnostic data into a structured object and supports formatting it for clipboard copying.",
  "frontend/src/main.tsx": "Bootstraps the React app, mounting it with React Query and Internet Identity providers.",
  "frontend/src/pages/DiagnosticsPage.tsx": "Displays system and preflight diagnostics with copy‑to‑clipboard support and UI badges for method results and statuses.",
  "frontend/src/pages/GameDetailPage.tsx": "Page that loads and displays catalog and crafting game details, filters items by category and search, and handles loading and error states.",
  "frontend/src/pages/GameSearchPage.tsx": "Game library search page that fetches catalog games, provides a search bar, and renders results with loading and error handling.",
  "frontend/src/pages/ItemDetailPage.tsx": "Item detail page that loads a specific game's item, shows its metadata and required materials, and handles loading and error states.",
  "frontend/src/state/preflightDiagnosticsStore.ts": "Zustand store managing preflight diagnostic state with methods for running, skipping, completing, and resetting checks.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, animations, and container settings.",
  "project_state.json": "Project metadata describing state, versioning, notes, and feature request tracking."
}