{
  "backend/main.mo": "Defines types and an actor that stores crafting games and catalog data, providing query methods for games, items, search, categories, and update status.",
  "backend/migration.mo": "Provides a no-op migration module that returns the previous actor unchanged.",
  "feature_evidence.json": "Feature evidence report mapping one publish-to-production feature to its related files, components, and tests.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend source files, used for build planning or analysis tooling.",
  "frontend/docs/publish-to-production.md": "Documentation outlining the steps and checks required to promote the current draft build to production without rebuilding.",
  "frontend/index.css": "Global Tailwind-based CSS defining theme variables, dark mode styles, and base UI styling.",
  "frontend/index.html": "HTML entry point with deep-link restoration logic and script bootstrap for the SPA.",
  "frontend/public/404.html": "SPA fallback page that captures the requested path, stores it, and redirects to the root for client-side routing.",
  "frontend/src/App.tsx": "Main React application wiring routes, preflight checks, query client, layout, and deep-link restoration.",
  "frontend/src/components/EmptyState.tsx": "Reusable component showing an empty-state message with optional title, description, and icon.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing attribution, copyright, and a link to diagnostics.",
  "frontend/src/components/layout/Header.tsx": "Sticky header with logo, title, and a home-navigation button.",
  "frontend/src/hooks/useActor.ts": "Creates and caches backend actors based on identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication and loading persisted identities.",
  "frontend/src/hooks/useProductionPreflight.ts": "Runs one-time backend connectivity checks on load and stores structured results in the diagnostics store.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching games, catalog data, items, and update statuses through the backend actor.",
  "frontend/src/index.css": "Configures Tailwind layers and theme variables for a parchment-style light and dark UI with subtle textures.",
  "frontend/src/lib/diagnostics/collectFrontendDiagnostics.ts": "Collects runtime, environment, build, and preflight diagnostics into a structured object for reporting or copying.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and mounts it to the DOM.",
  "frontend/src/pages/DiagnosticsPage.tsx": "Renders a diagnostics UI showing environment info and preflight results, with clipboard copy support and fallback selection mode.",
  "frontend/src/pages/GameDetailPage.tsx": "Displays detailed game information, including crafting data and item filtering by category or search term.",
  "frontend/src/pages/GameSearchPage.tsx": "Provides a searchable game library view with a hero banner and dynamic filtering of catalog games.",
  "frontend/src/pages/ItemDetailPage.tsx": "Shows detailed info for a specific item, including category, required materials, and stats, with loading and error handling.",
  "frontend/src/state/preflightDiagnosticsStore.ts": "Zustand store managing preflight diagnostics state, including running, skipped, and completed statuses.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, typography, animations, and content scanning paths.",
  "project_state.json": "Metadata describing project state, schema version, features, and configuration for build planning."
}