{
  "backend/main.mo": "Defines data models and query methods for games, items, categories, and update statuses, storing crafting and catalog game data and exposing retrieval/search functions.",
  "feature_evidence.json": "Metadata report mapping features to related frontend files, components, and tests for deployment verification.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of major frontend components, hooks, pages, and configuration files.",
  "frontend/index.css": "Tailwind base styles defining color tokens, dark mode variables, and global styling rules.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx with the production title.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, global layout, theme provider, and triggers production preflight checks.",
  "frontend/src/components/EmptyState.tsx": "Reusable component showing a fallback message when no data or search results are found.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying copyright, branding, and a caffeine.ai attribution link.",
  "frontend/src/components/layout/Header.tsx": "Sticky header with app logo, title, and a home-navigation button.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing authenticated or anonymous backend actors with query invalidation logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity auth context and provider enabling login, logout, and identity state management.",
  "frontend/src/hooks/useProductionPreflight.ts": "Runs initial non-blocking backend connectivity checks for various actor methods and logs diagnostic results.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching games, catalog data, items, and statuses from the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme variables for light and dark modes with a paper-textured aesthetic.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with query and identity providers before rendering App.",
  "frontend/src/pages/GameDetailPage.tsx": "Displays detailed info for a selected game, including items, categories, search, and crafting status.",
  "frontend/src/pages/GameSearchPage.tsx": "Shows a searchable catalog of games with loading states, error handling, and a hero banner.",
  "frontend/src/pages/ItemDetailPage.tsx": "Displays detailed information for a specific item, including category, materials, and stats with navigation.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended color system, fonts, animations, and plugins like typography and container queries.",
  "project_state.json": "Defines project state metadata, existing features, pending feature requests, and notes for a draft-to-production deployment workflow."
}