{
  "backend/main.mo": "Main actor defining game, item, and catalog types with query methods for fetching games, items, search results, categories, and update status.",
  "backend/migration.mo": "Migration module converting old actor state to new structure by adding an empty catalogGames map.",
  "feature_evidence.json": "Feature evidence report mapping a frontend game-discovery feature to impacted files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their purpose and behavior.",
  "frontend/index.css": "Tailwind base/theme CSS defining color tokens, dark mode variables, and global layout styling.",
  "frontend/index.html": "HTML entry point mounting the root React app and loading main.tsx.",
  "frontend/src/App.tsx": "Application root defining router setup with routes for search, game details, and item details wrapped in layout components.",
  "frontend/src/components/EmptyState.tsx": "Reusable UI component showing an empty-state message with optional icon, title, and description.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying attribution text and link using a styled layout.",
  "frontend/src/components/layout/Header.tsx": "Header with app branding, navigation link, and a home button using TanStack Router.",
  "frontend/src/hooks/useActor.ts": "React hook creating and caching the backend actor, handling identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication hook and provider managing Internet Identity login state, stored identities, and related context.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching games, items, and update status from an actor API with structured query keys.",
  "frontend/src/index.css": "Defines Tailwind base layers and theme CSS variables, including light/dark color palettes and a subtle paper texture.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/GameDetailPage.tsx": "Renders detailed game info with filtering, category tabs, and item lists using data from catalog and crafting queries.",
  "frontend/src/pages/GameSearchPage.tsx": "Displays a searchable list of catalog games with a hero banner, loading states, and error handling.",
  "frontend/src/pages/ItemDetailPage.tsx": "Shows detailed item information including category, required materials, and navigation back to the game page.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and plugin integrations reflecting the app’s theme.",
  "project_state.json": "Defines overall project metadata, goals, architectural notes, and a list of existing implemented or planned features for a crafting‑database game app. Tracks schema version, project state version, and descriptive information used for build planning."
}