{
  "kind": "build_request",
  "title": "Promote the currently deployed draft to production",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Promote the currently deployed draft release (Draft Version 2) to the production environment so the production deployment serves the same app functionality as the reviewed draft.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Proceed to production"
        ]
      },
      "acceptanceCriteria": [
        "A production deployment is created from the current draft (Draft Version 2).",
        "The production app loads successfully and core flows work: game search/list, game detail, item detail pages render without runtime errors.",
        "Production deployment does not show draft-only messaging or review-only banners (if any exist)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Run a pre-production verification pass covering backend canister availability and frontend API connectivity to ensure the production frontend can query the Motoko actor methods used by the UI (e.g., getCatalogGames, getCatalogGame, getGames, getGame, getItems, getItem, getItemsByCategory, getUpdateStatus).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Proceed to production"
        ]
      },
      "acceptanceCriteria": [
        "From the production frontend, queries for catalog games and crafting games return successfully (or return empty lists without errors if no data exists).",
        "Navigating between routes '/', '/game/$gameId', and '/game/$gameId/item/$itemId' works in production without broken links or blank screens.",
        "No uncaught exceptions occur in the browser console during basic navigation and data loading."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui or other paths listed as immutable in SYSTEM_CONTEXT.",
    "Keep all Motoko logic within the single main actor (backend/main.mo); do not introduce additional backend services."
  ],
  "nonGoals": [
    "Adding new app features or changing the existing UI/UX beyond what is required for a production promotion.",
    "Changing backend data schemas or adding migrations unless required to complete the production promotion."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}