{
  "kind": "build_request",
  "title": "Crafting Database App for Video Games (Game Search, Item Browser, Recipes, Upgrades, Web Updates)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a core data model for crafting-focused video games that supports: (1) games, (2) craftable/buildable objects (food, tools, buildings, etc.), (3) per-object required supplies/materials with quantities, (4) per-object possible upgrades (upgrade paths/levels and their added/changed requirements), and (5) per-object values (e.g., sell value, durability, stats, or other numeric/string value fields). Persist this data in the Motoko backend so it can be queried by the frontend.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Make an application for video games with crafting mechanics where you can look up the game and it will list every buildable object from food, to tools, to buildings, listing supplies needed, possible upgrades, and values, using the internet to track any updates"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes types and stable storage for Game and CraftableItem records.",
        "Each CraftableItem can include: category, materials list (material name + quantity), upgrades list (at least name/level + changes), and values map/list.",
        "Data remains available across canister upgrades (use stable structures or stable vars)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement backend query APIs to support the app’s primary flows: list/search games; fetch a game by id; list/search/filter craftable items for a selected game (by name and category); fetch craftable item details by id including supplies, upgrades, and values.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "where you can look up the game and it will list every buildable object ... listing supplies needed, possible upgrades, and values"
        ]
      },
      "acceptanceCriteria": [
        "There are backend methods to: (1) list/search games, (2) get game details, (3) list/search items for a game with optional category filter, (4) get item details.",
        "Responses are deterministic and do not require frontend-side joining to reconstruct an item’s recipe/upgrades/values."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a data update mechanism that can incorporate crafting database updates “from the internet”: allow each game to have one or more configurable remote data sources (HTTPS URL endpoints returning JSON). Implement backend functions to (a) fetch and validate remote data, (b) upsert it into stored game/item data, and (c) record per-game lastUpdated timestamp and update status (success/failure + message). Provide a manual “Refresh data” action callable from the frontend to trigger an update for a selected game.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "using the internet to track any updates"
        ]
      },
      "acceptanceCriteria": [
        "Backend stores, per game, at least one remote source URL and last update metadata (timestamp + status).",
        "Frontend provides a visible ‘Refresh data’ control on the game page and displays last update timestamp/status.",
        "When refresh succeeds, item lists/details reflect the updated data without requiring a full page reload.",
        "If refresh fails, the app shows a non-crashing error state and retains the last known good data."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Build the frontend UX to look up and select a game, then browse that game’s crafting database: a game search/list page; a game detail page with category tabs/filters (Food/Tools/Buildings/Other); an item list with search; and an item detail view showing required supplies, possible upgrades, and values in a clear, scannable layout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "look up the game and it will list every buildable object from food, to tools, to buildings, listing supplies needed, possible upgrades, and values"
        ]
      },
      "acceptanceCriteria": [
        "User can search/select a game and navigate to its item list.",
        "User can filter items by category and search by item name.",
        "Item detail view renders: materials/quantities, upgrades (if any), and values (if any).",
        "All user-facing text is in English."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Use React Query for all backend data fetching and cache invalidation. Ensure refresh/update operations invalidate the relevant queries (game metadata, item lists, item details) so the UI stays consistent.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ]
      },
      "acceptanceCriteria": [
        "All reads (games/items/item detail) use React Query hooks.",
        "Triggering a refresh results in query invalidation/refetch and updated UI state.",
        "Loading and error states are implemented for all main screens."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Establish a coherent visual theme for the app and apply it consistently across pages (typography, spacing, components, and colors). Theme direction: ‘Workshop ledger’—warm neutrals, paper-like surfaces, subtle grid/ruled accents, and crafting-inspired iconography. Avoid blue/purple as primary brand colors.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ]
      },
      "acceptanceCriteria": [
        "The app has a consistent theme across navigation, lists, and detail panels.",
        "Primary colors are not blue/purple; the UI uses warm neutrals and a workshop/ledger feel.",
        "Key UI surfaces (cards/tables) are readable and visually structured."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Add generated static image assets to support the theme and reference them in the UI (store in frontend/public/assets/generated). Include: an app logo and a subtle hero/banner illustration.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ]
      },
      "acceptanceCriteria": [
        "Generated images exist under frontend/public/assets/generated and are referenced directly as static assets (not served via backend).",
        "Logo is used in the header/navigation; hero/banner is used on the landing/game search page without harming readability."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (single-actor architecture).",
    "Do not edit files under frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose instead of modifying).",
    "Do not introduce external databases or non-Motoko backend services.",
    "Any internet-based update mechanism must use generic HTTPS/JSON sources (no restricted third-party auth integrations)."
  ],
  "nonGoals": [
    "Implementing real-time multiplayer or chat.",
    "Supporting third-party authentication providers other than Internet Identity.",
    "Building a complete dataset for every game at launch; initial build can ship with seed/sample data plus the update/import mechanism.",
    "Integrating maps/geolocation or social media APIs."
  ],
  "imageRequirements": {
    "required": [
      "App logo, workshop-ledger style, simple emblem (app-logo.dim_512x512.png)",
      "Wide banner illustration, cozy crafting bench with parchment/ledger aesthetic (hero-banner.dim_1600x900.png)"
    ],
    "edits": []
  }
}